create table [Таблица поставщиков S] (
[Номер_поставщика] char(6) not null,
[Фамилия] char(20) null,
[Рейтинг] int null,
[Город] char(20) null)
 insert into [Таблица поставщиков S] ([Номер_поставщика], [Фамилия], [Рейтинг], [Город])
 values ('S1', 'Смит', '20', 'Лондон'),
 ('S2', 'Джонс', '10', 'Париж'),
 ('S3', 'Блейк', '30', 'Париж'),
 ('S4', 'Кларк', '20', 'Лондон'),
 ('S5', 'Адамс', '30', 'Афины')
select * from [Таблица поставщиков S]

create table [Таблица деталей P] (
[Номер_детали] char(6) not null,
[Название] char(20) null,
[Цвет] char(20) null,
[Вес] int null,
[Город] char(20) null) 
 insert into [Таблица деталей P] ([Номер_детали], [Название], [Цвет], [Вес], [Город])
 values ('P1', 'Гайка', 'Красный', '12', 'Лондон'),
 ('P2', 'Болт', 'Зеленый', '17', 'Париж'),
 ('P3', 'Винт', 'Голубой', '17', 'Рим'),
 ('P4', 'Винт', 'Красный', '14', 'Лондон'),
 ('P5', 'Кулачок', 'Голубой', '12', 'Париж'),
 ('P6', 'Блюм', 'Красный', '19', 'Лондон')
select * from [Таблица деталей P]

---3---

create table [Таблица изделий J] (
[Номер изделия] char(6) not null,
[Название] char(20) null,
[Город] char(20) null) 
 insert into [Таблица изделий J] ([Номер изделия], Название, Город)
 values ('J1', 'Жесткий диск', 'Париж'),
 ('J2', 'Перфоратор', 'Рим'),
 ('J3', 'Считыватель', 'Афины'),
 ('J4', 'Принтер', 'Афины'),
 ('J5', 'Флоппи-диск', 'Лондон'),
 ('J6', 'Терминал', 'Осло'),
 ('J7', 'Лента', 'Лондон')
select * from [Таблица изделий J]

---4---

create table [Таблица поставок SPJ] (
[Номер поставщика] char(6) null,
[Номер детали] char(6) null,
[Номер изделия] char(6) null,
[Количество] int null) 
 insert into [Таблица поставок SPJ] ([Номер поставщика], [Номер детали], [Номер изделия], [Количество])
 values ('S1', 'P1', 'J1', 200),
('S1', 'P1', 'J4', 700),
('S2', 'P3', 'J1', 400),
('S2', 'P3', 'J2', 200),
('S2', 'P3', 'J3', 200),
('S2', 'P3', 'J4', 500),
('S2', 'P3', 'J5', 600),
('S2', 'P3', 'J6', 400),
('S2', 'P3', 'J7', 800),
('S2', 'P5', 'J2', 100),
('S3', 'P3', 'J1', 200),
('S3', 'P4', 'J2', 400),
('S4', 'P6', 'J3', 300),
('S4', 'P6', 'J7', 300),
('S5', 'P2', 'J2', 200),
('S5', 'P2', 'J4', 100),
('S5', 'P5', 'J5', 500),
('S5', 'P5', 'J7', 100),
('S5', 'P6', 'J2', 200),
('S5', 'P1', 'J4', 100),
('S5', 'P3', 'J4', 200),
('S5', 'P4', 'J4', 800),
('S5', 'P5', 'J4', 400),
('S5', 'P6', 'J4', 500)
select * from [Таблица поставок SPJ]


Alter table [Таблица поставок SPJ]
add [Дата поставки] date 

update [Таблица поставок SPJ]
set [Дата поставки] = '18.01.2023'
select * from [Таблица поставок SPJ]