select * from [Таблица изделий J] 
where Город like 'А%' 
order by Город

select [Таблица деталей P].Цвет from [Таблица поставок SPJ] inner join [Таблица деталей P] on [Таблица поставок SPJ].[Номер детали] = [Таблица деталей P].Номер_детали
where [Номер поставщика] = 'S1'

select Фамилия,[Таблица поставщиков S].Номер_поставщика,Количество from [Таблица поставок SPJ] inner join [Таблица поставщиков S] on 
[Таблица поставок SPJ].[Номер поставщика] = [Таблица поставщиков S].Номер_поставщика
where [Таблица поставок SPJ].[Номер детали] = 'P1' 
group by Количество,Фамилия,[Таблица поставщиков S].Номер_поставщика
having [Таблица поставок SPJ].Количество > AVG ([Таблица поставок SPJ].Количество)

select distinct [Таблица поставок SPJ].[Номер изделия], [Номер детали] from 
(([Таблица изделий J] inner join [Таблица поставок SPJ] on [Таблица поставок SPJ].[Номер изделия] = [Таблица изделий J].[Номер изделия])
inner join [Таблица деталей P]  on [Таблица поставок SPJ].[Номер детали] = [Таблица деталей P].[Номер_детали]) 

select [Номер поставщика],count(distinct [Номер изделия]) as Количество_изделий from [Таблица поставок SPJ] 
group by [Номер поставщика]
having [Номер поставщика] = 'S2'

select [Таблица поставок SPJ].[Номер детали],[Номер изделия],Цвет,COUNT([Номер поставщика]) as Количество_поставщиков from [Таблица деталей P] inner join [Таблица поставок SPJ] on [Таблица деталей P].Номер_детали = [Таблица поставок SPJ].[Номер детали]
group by [Таблица поставок SPJ].[Номер детали],[Номер изделия],Цвет
having Цвет = 'Красный'

select [Номер изделия],SUM(Количество) as [Общий объём поставок] from [Таблица поставок SPJ]
group by [Номер изделия]
having [Номер изделия] = 'J2'

select * from [Таблица поставщиков S]

update [Таблица деталей P] 
set Цвет = 'Жёлтый' 
where Цвет = 'Красный' and Вес < 15

update [Таблица поставщиков S]
set Рейтинг += 5
where Город = 'Лондон'